TIMEDELTA_MSK = 3 #hours
REPORT_PERIOD = 7 #days

UPDATE_TIME = '23:59'
UPDATE_PERIOD = 1 #days
UPDATE_WEEKDAY = 7 #monday-1

INCOMES_AMOUNT = 3

WB_STORAGE_DATE_FROM = '2000-01-01'
WB_STORAGE_EXCEPTIONS = ['Санкт-Петербург Шушары',]

WB_STAT_API_MAIN_PATH = 'https://statistics-api.wildberries.ru/'
WB_STORAGE_API_PATH = 'api/v1/supplier/stocks'
WB_SALES_API_PATH = 'api/v1/supplier/sales'
WB_INCOME_API_PATH = 'api/v1/supplier/incomes'

OZON_STAT_API_MAIN_PATH = 'https://api-seller.ozon.ru/'
OZON_STORAGE_API_PATH = 'v2/analytics/stock_on_warehouses'
OZON_SALES_API_PATH = 'v1/analytics/data'
OZON_INCOME_API_PATH = 'v1/supply-order/list'
OZON_PRODUCTS_IN_INCOME_API_PATH = 'v1/supply-order/items'
OZON_ACTIONS_PATH = 'v1/actions'
OZON_ACTIONS_PRODUCTS_PATH = 'v1/actions/candidates'
OZON_SKU_PATH = 'v2/product/info'


wb_warehouses = ('total', 'Электросталь', 'Коледино', 'Подольск', 'Белые Столбы',
     'Белая дача', 'Санкт-Петербург Уткина Заводь', 'Екатеринбург - Испытателей 14г',
     'Казань', 'Тула', 'Краснодар', 'Новосибирск', 'Невинномысск', 'Екатеринбург - Перспективный 12',
     'Хабаровск', 'СЦ Хабаровск', 'Волгоград', 'Обухово',  
     'Рязань (Тюшевское)', 'Минск', 'Крыловская', 'Атакент', 'Чехов 2',
     'Иваново', 'Пушкино', 'Вёшки', 'Чехов 1', 
     'Астана',  'СЦ Кузнецк', 'Новосемейкино',  'Радумля 1', 'СЦ Ижевск',
     'Котовск', 'Чашниково',)

ozon_warehouses = ('total', 'СОФЬИНО РФЦ', 'КАЛИНИНГРАД МРФЦ', 'ПУШКИНО 1 РФЦ', 'ПУШКИНО 2 РФЦ', 
        'ЖУКОВСКИЙ РФЦ', 'ТВЕРЬ РФЦ', 'Казань РФЦ НОВЫЙ', 'Екатеринбург РФЦ НОВЫЙ', 
        'СПБ ШУШАРЫ РФЦ', 'СПБ БУГРЫ РФЦ', 'Ростов на Дону РФЦ', 'НИЖНИЙ НОВГОРОД РФЦ', 
        'САМАРА РФЦ', 'ХАБАРОВСК 2 РФЦ', 'КРАСНОЯРСК МРФЦ', 'НОВОРОССИЙСК МРФЦ', 
        'НОГИНСК РФЦ', 'ПЕТРОВСКОЕ РФЦ', 'ХОРУГВИНО РФЦ', 'Санкт Петербург РФЦ', 'Новосибирск РФЦ НОВЫЙ',)

WB_STORAGES = {i: 0 for i in wb_warehouses}
OZON_STORAGES = {i: 0 for i in ozon_warehouses}

OZON_SKU = {
        511627693: 971008116, 
        511630697: 971020097, 
        633072177: 0, 
        735669852: 1298272081, 
        78606759: 269521986, 
        78609023: 269522363, 
        78609268: 269525452, 
        78609399: 270816313, 
        78609932: 269527571, 
        78610229: 269530466, 
        78635068: 269852159, 
        78635240: 270198343, 
        78635725: 270200766, 
        78638108: 269923463, 
        78843144: 269871034, 
        78861619: 269898492, 
        78863581: 269870507, 
        78864532: 269873188, 
        108030852: 300346420, 
        114092402: 306010934, 
        124546494: 323448550, 
        137733286: 345998381, 
        137739246: 346018142, 
        240746796: 513385778, 
        403915936: 778729953, 
        702431548: 1268097107, 
        702440558: 1268104953, 
        889174442: 1435046200, 
        889174455: 1435046258, 
        889174489: 1435046216, 
        944033594: 1480807381, 
        944033595: 1480805823, 
        944033600: 1480807210, 
        78621841: 270194281, 
        78627838: 269554496, 
        78634563: 269533838, 
        78862780: 269872976, 
        78864856: 269871125, 
        84165548: 277566342, 
        84165708: 277567624, 
        84167356: 277569364, 
        84167478: 279128487, 
        84167650: 279118848, 
        247306255: 524014439,
        247308803: 524020651, 
        247310082: 524026343, 
        247311152: 524028026, 
        247312368: 525248545, 
        445699933: 852621333, 
        445701493: 852604821, 
        445704694: 852597053, 
        511635736: 971057705, 
        513762246: 974828706, 
        558683302: 1054895000, 
        602675251: 0, 
        602676874: 0, 
        602677694: 0, 
        511607950: 970996145,
        511613004: 970999628, 
        511619094: 970993778, 
        38096279: 201449246, 
        38096855: 201449283, 
        38097017: 201449259, 
        38097872: 201449288, 
        38099214: 201468053, 
        38101936: 201455503, 
        38102161: 201455558, 
        38102323: 201455563, 
        38104466: 201455648, 
        38106285: 201459717, 
        38108599: 201459723, 
        38110491: 201459736, 
        38114521: 201459759, 
        38117561: 201459807, 
        77049505: 270046280, 
        77050388: 268947773, 
        77053113: 268930966, 
        77056215: 268929382, 
        108030949: 301440522, 
        114086047: 305982109, 
        247321001: 524052951, 
        247322352: 524060822, 
        247322872: 524061675, 
        247323937: 524064242, 
        513760112: 974824723, 
        633072161: 0, 
        702397385: 1268073503, 
        702405084: 1268114346, 
        888996492: 1434890809, 
        888996528: 1434894142, 
        888996529: 1434893252, 
        944014068: 1480788085, 
        944014172: 1480788399, 
        944014175: 1480788406, 
        38116457: 201717924, 
        38102494: 201455564, 
        38103505: 201455567, 
        38103656: 201455591, 
        124566170: 323521953, 
        137772971: 346073812, 
        137775108: 346077387, 
        240749184: 513393767, 
        247316685: 524040924, 
        247318868: 524047819, 
        247320146: 524050286, 
        247329538: 524065775, 
        445660722: 852560065, 
        445665326: 852573865, 
        445671887: 852568837, 
        558671340: 1054887934, 
        602672261: 0, 
        602672850: 0, 
        602674117: 0, 
        735665729: 
        1298268231}